OpenFOAM-v1712/tutorials/lagrangian/reactingParcelFoam/parcelInBox/0/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }
    front
    {
        type            symmetryPlane;
    }
    walls
    {
        type            MarshakRadiation;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            MarshakRadiation;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           uniform 0;
    }
}


// ************************************************************************* //
